//<MStar Software>
//******************************************************************************
// MStar Software
// Copyright (c) 2010 - 2014 MStar Semiconductor, Inc. All rights reserved.
// All software, firmware and related documentation herein ("MStar Software") are
// intellectual property of MStar Semiconductor, Inc. ("MStar") and protected by
// law, including, but not limited to, copyright law and international treaties.
// Any use, modification, reproduction, retransmission, or republication of all
// or part of MStar Software is expressly prohibited, unless prior written
// permission has been granted by MStar.
//
// By accessing, browsing and/or using MStar Software, you acknowledge that you
// have read, understood, and agree, to be bound by below terms ("Terms") and to
// comply with all applicable laws and regulations:
//
// 1. MStar shall retain any and all right, ownership and interest to MStar
//    Software and any modification/derivatives thereof.
//    No right, ownership, or interest to MStar Software and any
//    modification/derivatives thereof is transferred to you under Terms.
//
// 2. You understand that MStar Software might include, incorporate or be
//    supplied together with third party`s software and the use of MStar
//    Software may require additional licenses from third parties.
//    Therefore, you hereby agree it is your sole responsibility to separately

//    claim against MStar for any loss, damage, cost or expense that you may
//    incur related to your use of MStar Software.
//    In no event shall MStar be liable for any direct, indirect, incidental or
//    consequential damages, including without limitation, lost of profit or
//    revenues, lost or damage of data, and unauthorized system use.
//    You agree that this Section 4 shall still apply without being affected
//    even if MStar Software has been modified by MStar in accordance with your
//    request or instruction for your use, except otherwise agreed by both
//    parties in writing.
//
// 5. If requested, MStar may from time to time provide technical supports or
//    services in relation with MStar Software to you for your use of
//    MStar Software in conjunction with your or your customer`s product
//    ("Services").
//    You understand and agree that, except otherwise agreed by both parties in
//    writing, Services are provided on an "AS IS" basis and the warranty
//    disclaimer set forth in Section 4 above shall apply.
//
// 6. Nothing contained herein shall be construed as by implication, estoppels
//    or otherwise:
//    (a) conferring any license or right to use MStar name, trademark, service
//        mark, symbol or any other identification;
//    (b) obligating MStar or any of its affiliates to furnish any person,
//        including without limitation, you and your customers, any assistance
//        of any kind whatsoever, or any information; or
//    (c) conferring any license or right under any intellectual property right.
//
// 7. These terms shall be governed by and construed in accordance with the laws
//    of Taiwan, R.O.C., excluding its conflict of law rules.
//    Any and all dispute arising out hereof or related hereto shall be finally
//    settled by arbitration referred to the Chinese Arbitration Association,
//    Taipei in accordance with the ROC Arbitration Law and the Arbitration
//    Rules of the Association by three (3) arbitrators appointed in accordance
//    with the said Rules.
//    The place of arbitration shall be in Taipei, Taiwan and the language shall
//    be English.
//    The arbitration award shall be final and binding to both parties.
//
//******************************************************************************
//<MStar Software>

#include "ursautils.h"
#include <apiSWI2C.h>
#include "MsOS.h"
#include "MsTypes.h"
#include "drvCPU.h"
#include <mmap.h>
#include <iniparser.h>
#include <stdbool.h>

//============for ISP Upgrade============

#define URSA_ISP_I2C_BUS_SEL 0x0
#define SPI_WRITE           0x10
#define SPI_READ            0x11
#define SPI_STOP            0x12

#define CCMD_DATA_WRITE 0x10

#define BANKSIZE    0x10000
#define BLOCKNUM  0xff
#define BLOCKSIZE 0x100

#define ENTER_ISP_ERROR_MAX     20
#define GET_ID_ERROR_MAX        10

#define SW_IIC_READ             0
#define SW_IIC_WRITE            1
#define CONFIG_URSA_INI              "/config/Ursa/ursa_upgrade.ini"

typedef struct {
    uint32_t size;// 1-4
    uint8_t manuFacturerId;// 5
    uint8_t deviceId;// 6
    uint8_t WREN;// 7
    uint8_t WRDI;// 8
    uint8_t RDSR;// 9
    uint8_t WRSR;// 10
    uint8_t READS;// 11
    uint8_t FAST_READ;// 12
    uint8_t PG_PROG;// 13
    uint8_t SECTOR_ERASE;// 14
    uint8_t BLOCK_ERASE;// 15
    uint8_t CHIP_ERASE;// 16
    uint8_t RDID;// 17
    uint8_t LOCK;// 18
    uint16_t chipEraseMaxTime;// 19-20//Unit:100ms
} SFlashType;

uint8_t g_ucflashtype;
uint8_t g_ucbannumber;
SFlashType g_sflash;

uint8_t g_curpercent;
uint32_t g_ispsrcaddr;
uint32_t g_ispcodesize;
FlashProgErrorType g_errorflag;
FlashProgStateType g_eflashprogramstate;

uint8_t g_slaveaddr = 0x94;
uint8_t g_serialdebugaddr = 0xB8;
uint8_t g_ursai2cbusnum = 1;

static SWI2C_BusCfg g_ursai2cbuscfg[1] = {
    // Bus-0
    {0, 0, 0}, //IS_SW_I2C  /SCL_PAD /SDA_PAD /Delay
};

SFlashType g_supportsflash[Flash_NUMS] = {
// 1-4:size ,5:manuFacturerId,6:deviceId,7:WREN,8:WRDI,9:RDSR,10:WRSR,11:READ,12:FAST_READ,
// 13:PG_PROG,14:SECTOR_ERASE,15:BLOCK_ERASE,16:CHIP_ERASE,17:RDID,18:LOCK,19-20: chipEraseMaxTime

//                     1-4     ,5   ,6   ,7   ,8   ,9  ,10  ,11  ,12  ,13  ,14  ,15  ,16  ,17 ,18 ,19-20
//PMC
{/*"PMC25LV512A", */  0x20000,0x9D,0x7B,0x06,0x04,0x05,0x01,0x03,NULL,0x02,0xD7,0xD8,0xC7,0xAB,0x0C,40  },
